# Lab | Data Cleaning and Formatting

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

# Challenge 1: Data Cleaning and Formatting

## Exercise 1: Cleaning Column Names

To ensure consistency and ease of use, standardize the column names of the dataframe. Start by taking a first look at the dataframe and identifying any column names that need to be modified. Use appropriate naming conventions and make sure that column names are descriptive and informative.

*Hint*:
- *Column names should be in lower case*
- *White spaces in column names should be replaced by `_`*
- *`st` could be replaced for `state`*

In [1]:
# Your code here
import pandas as pd

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv")
df.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [10]:
df.describe()

             income  monthly_premium_auto  total_claim_amount
count   1071.000000           1071.000000         1071.000000
mean   39295.701214            193.234360          404.986909
std    30469.427060           1601.190369          293.027260
min        0.000000             61.000000            0.382107
25%    14072.000000             68.000000          202.157702
50%    36234.000000             83.000000          354.729129
75%    64631.000000            109.500000          532.800000
max    99960.000000          35354.000000         2893.239678

In [11]:
df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [13]:
# Your code here
df.shape

(4008, 11)

In [14]:
df.columns
df.rename(columns= {'ST': 'state'}, inplace=True)

In [15]:
for col in df.columns:
    df.rename(columns={col: col.lower()}, inplace=True)

#df.columns = [col.lower() for col in df.columns]

In [16]:
df.columns

Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount'],
      dtype='object')

## Exercise 2: Cleaning invalid Values

The dataset contains columns with inconsistent and incorrect values that could affect the accuracy of our analysis. Therefore, we need to clean these columns to ensure that they only contain valid data.

Note that this exercise will focus only on cleaning inconsistent values and will not involve handling null values (NaN or None).

*Hint*:
- *Gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized, for example, to "M" and "F".*
- *State abbreviations be can replaced with its full name, for example "AZ": "Arizona", "Cali": "California", "WA": "Washington"*
- *In education, "Bachelors" could be replaced by "Bachelor"*
- *In Customer Lifetime Value, delete the `%` character*
- *In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"*

In [17]:
# Your code here
import numpy as np

df['gender'] = df['gender'].str.strip()
df['state'] = df['state'].str.strip()

In [18]:
df.nunique()

customer                     1071
state                           8
gender                          5
education                       6
customer_lifetime_value      1027
income                        774
monthly_premium_auto          132
number_of_open_complaints       6
policy_type                     3
vehicle_class                   6
total_claim_amount            761
dtype: int64

In [19]:
df.gender.unique()

array([nan, 'F', 'M', 'Femal', 'Male', 'female'], dtype=object)

In [20]:
def standardize_gender(value):
    if isinstance(value, str): #this is in case there is a non-string object in the values like NaN
        value = value.lower()
        if value in ['M', 'male']:
                 return 'Male'
        elif value in ['F', 'Femal','female']:
                return 'Female'
    return 'Unknown'
    
    
    #creating a function to standardize Gender values

In [ ]:
df['gender'] = df['gender'].apply(standardize_gender)

In [22]:
df.state.unique()

array(['Washington', 'Arizona', 'Nevada', 'California', 'Oregon', 'Cali',
       'AZ', 'WA', nan], dtype=object)

In [23]:
def standardize_states(value):
    if isinstance(value, str):
        value = value.lower()
        if value in ['cali', 'California']:
            return 'california'
        elif value in ['wa', 'Washington']:
            return 'washington'
        elif value in ['az', 'Arizona']:
            return 'Arizona'
    return value

In [24]:
df['state'] = df['state'].apply(standardize_states)

In [25]:
df.state.unique()

array(['washington', 'arizona', 'nevada', 'california', 'oregon',
       'Arizona', nan], dtype=object)

In [26]:
df.vehicle_class.unique()

array(['Four-Door Car', 'Two-Door Car', 'SUV', 'Luxury SUV', 'Sports Car',
       'Luxury Car', nan], dtype=object)

In [27]:
def standardize_luxury(value):
    if isinstance(value, str):
        value = value.lower()
        if value in ['Sports Car', 'Luxury SUV', 'Luxury Car']:
            return 'Luxury'
        return value.lower()

In [28]:
df['vehicle_class'] = df['vehicle_class'].apply(standardize_luxury)

In [32]:
df.education.unique()

def standardize_education(value):
    if isinstance(value, str):
        value = value.lower()
        if value in ['Bachelors']:
            return 'Bachelor'      
        return value.lower()

In [33]:
df['education'] = df['education'].apply(standardize_education)

In [34]:
df['customer_lifetime_value'] = df['customer_lifetime_value'].str.replace('%', ' ', regex=False)

In [35]:
df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,washington,NaN,master,NaN,0.0,1000.0,1/0/00,Personal Auto,four-door car,2.704934
1,QZ44356,arizona,F,bachelor,697953.59,0.0,94.0,1/0/00,Personal Auto,four-door car,1131.464935
2,AI49188,nevada,F,bachelor,1288743.17,48767.0,108.0,1/0/00,Personal Auto,two-door car,566.472247
3,WW63253,california,M,bachelor,764586.18,0.0,106.0,1/0/00,Corporate Auto,suv,529.881344
4,GA49547,washington,M,high school or below,536307.65,36357.0,68.0,1/0/00,Personal Auto,four-door car,17.269323

## Exercise 3: Formatting data types

The data types of many columns in the dataset appear to be incorrect. This could impact the accuracy of our analysis. To ensure accurate analysis, we need to correct the data types of these columns. Please update the data types of the columns as appropriate.

It is important to note that this exercise does not involve handling null values (NaN or None).

*Hint*:
- *Customer lifetime value should be numeric*
- *Number of open complaints has an incorrect format. Look at the different values it takes with `unique()` and take the middle value. As an example, 1/5/00 should be 5. Number of open complaints is a string - remember you can use `split()` to deal with it and take the number you need. Finally, since it should be numeric, cast the column to be in its proper type.*

In [36]:
df.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value       object
income                       float64
monthly_premium_auto         float64
number_of_open_complaints     object
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

In [37]:
# df['customer_lifetime_value'] = df['customer_lifetime_value'].astype(int) 
# doesn't work right now because of NaN values 

df['customer_lifetime_value'] = pd.to_numeric(df['customer_lifetime_value'], errors = 'coerce')

In [38]:
  df.number_of_open_complaints.unique()

array(['1/0/00', '1/2/00', '1/1/00', '1/3/00', '1/5/00', '1/4/00', nan],
      dtype=object)

In [39]:
def extract_middle(s):
    if isinstance(s, str):
        parts = s.split('/')
        if len(parts) > 1: 
            return int(parts[1])
    return None


    #Had to modify function to handle instances of non-string values

In [40]:
df['number_of_open_complaints'] = df['number_of_open_complaints'].apply(extract_middle)

In [41]:
df.number_of_open_complaints.unique()

array([ 0.,  2.,  1.,  3.,  5.,  4., nan])

## Exercise 4: Dealing with Null values

Identify any columns with null or missing values. Identify how many null values each column has. You can use the `isnull()` function in pandas to find columns with null values.

Decide on a strategy for handling the null values. There are several options, including:

- Drop the rows or columns with null values
- Fill the null values with a specific value (such as the column mean or median for numerical variables, and mode for categorical variables)
- Fill the null values with the previous or next value in the column
- Fill the null values based on a more complex algorithm or model (note: we haven't covered this yet)

Implement your chosen strategy to handle the null values. You can use the `fillna()` function in pandas to fill null values or `dropna()` function to drop null values.

Verify that your strategy has successfully handled the null values. You can use the `isnull()` function again to check if there are still null values in the dataset.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling null values.

After formatting data types, as a last step, convert all the numeric variables to integers.

In [42]:
# Your code here
df.isnull().any()

customer                     True
state                        True
gender                       True
education                    True
customer_lifetime_value      True
income                       True
monthly_premium_auto         True
number_of_open_complaints    True
policy_type                  True
vehicle_class                True
total_claim_amount           True
dtype: bool

In [43]:
df.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value      float64
income                       float64
monthly_premium_auto         float64
number_of_open_complaints    float64
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

In [44]:
df.isnull()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,False,False,True,False,True,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
4003,True,True,True,True,True,True,True,True,True,True,True
4004,True,True,True,True,True,True,True,True,True,True,True
4005,True,True,True,True,True,True,True,True,True,True,True
4006,True,True,True,True,True,True,True,True,True,True,True
4007,True,True,True,True,True,True,True,True,True,True,True

In [45]:
df.isna().sum()

customer                     2937
state                        2937
gender                       3054
education                    2937
customer_lifetime_value      2940
income                       2937
monthly_premium_auto         2937
number_of_open_complaints    2937
policy_type                  2937
vehicle_class                2937
total_claim_amount           2937
dtype: int64

In [46]:
df.isna().sum(axis=1)

0        2
1        0
2        0
3        0
4        0
        ..
4003    11
4004    11
4005    11
4006    11
4007    11
Length: 4008, dtype: int64

In [47]:
df.describe()

,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount
count,1.068000e+03,1071.000000,1071.000000,1071.000000,1071.000000
mean,7.936903e+05,39295.701214,193.234360,0.394024,404.986909
std,6.434784e+05,30469.427060,1601.190369,0.883769,293.027260
min,2.004351e+05,0.000000,61.000000,0.000000,0.382107
25%,4.034080e+05,14072.000000,68.000000,0.000000,202.157702
50%,5.881742e+05,36234.000000,83.000000,0.000000,354.729129
75%,8.962872e+05,64631.000000,109.500000,0.000000,532.800000
max,5.816655e+06,99960.000000,35354.000000,5.000000,2893.239678

In [49]:
df.income.fillna(df.income.median(), inplace=True)

# df['customer_lifetime_value'] = df['customer_lifetime_value'].round(2)

# df.customer_lifetime_value.fillna(df.customer_lifetime_value.median()).tail()

df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,washington,NaN,master,NaN,0.0,1000.0,0.0,Personal Auto,four-door car,2.704934
1,QZ44356,arizona,F,bachelor,697953.59,0.0,94.0,0.0,Personal Auto,four-door car,1131.464935
2,AI49188,nevada,F,bachelor,1288743.17,48767.0,108.0,0.0,Personal Auto,two-door car,566.472247
3,WW63253,california,M,bachelor,764586.18,0.0,106.0,0.0,Corporate Auto,suv,529.881344
4,GA49547,washington,M,high school or below,536307.65,36357.0,68.0,0.0,Personal Auto,four-door car,17.269323

In [50]:
df['income'] = df['income'].round(2)
df.customer_lifetime_value.fillna(df.customer_lifetime_value.median(), inplace=True)
df['monthly_premium_auto'] = df['monthly_premium_auto'].round(2)
df.monthly_premium_auto.fillna(df.monthly_premium_auto.median(), inplace=True)
df['total_claim_amount']= df['total_claim_amount'].round(2)
df.total_claim_amount.fillna(df.total_claim_amount.median(), inplace=True)
df.number_of_open_complaints.fillna(float('1'), inplace=True)

In [ ]:
df.customer.fillna('N/A', inplace=True)
df.state.fillna('N/A', inplace=True)
df.education.fillna('N/A', inplace=True)
df.policy_type.fillna('N/A', inplace=True)
df.vehicle_class.fillna('N/A', inplace=True)

In [51]:
df.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value      float64
income                       float64
monthly_premium_auto         float64
number_of_open_complaints    float64
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

In [52]:
df.isnull()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,False,False,True,False,True,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
4003,True,True,True,True,True,False,True,True,True,True,True
4004,True,True,True,True,True,False,True,True,True,True,True
4005,True,True,True,True,True,False,True,True,True,True,True
4006,True,True,True,True,True,False,True,True,True,True,True
4007,True,True,True,True,True,False,True,True,True,True,True

## Exercise 5: Dealing with duplicates

Use the `.duplicated()` method to identify any duplicate rows in the dataframe.

Decide on a strategy for handling the duplicates. Options include:
- Dropping all duplicate rows
- Keeping only the first occurrence of each duplicated row
- Keeping only the last occurrence of each duplicated row
- Dropping duplicates based on a subset of columns
- Dropping duplicates based on a specific column

Implement your chosen strategy using the `drop_duplicates()` function.

Verify that your strategy has successfully handled the duplicates by checking for duplicates again using `.duplicated()`.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling duplicates.

Save the cleaned dataset to a new CSV file.

*Hint*: *after dropping duplicates, reset the index to ensure consistency*.

In [53]:
df.duplicated().sum()

2936

In [54]:
df.duplicated(subset=['customer']).sum()

2936

In [55]:
df.duplicated(subset=['state']).sum()

4001

In [56]:
df.drop_duplicates(inplace=True)

In [57]:
df_without_duplicates = df.copy()

In [58]:
df = df_without_duplicates.reset_index(drop=True, inplace=True)
df_without_duplicates.tail()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
1067,VJ51327,california,F,high school or below,2031499.76,63209.0,102.0,2.0,Personal Auto,suv,207.320041
1068,GS98873,arizona,F,bachelor,323912.47,16061.0,88.0,0.0,Personal Auto,four-door car,633.600000
1069,CW49887,california,F,master,462680.11,79487.0,114.0,0.0,Special Auto,suv,547.200000
1070,MY31220,california,F,college,899704.02,54230.0,112.0,0.0,Personal Auto,two-door car,537.600000
1071,NaN,NaN,NaN,None,NaN,36234.0,NaN,NaN,NaN,None,NaN

# Bonus: Challenge 2: creating functions on a separate `py` file

Put all the data cleaning and formatting steps into functions, and create a main function that performs all the cleaning and formatting.

Write these functions in separate .py file(s). By putting these steps into functions, we can make the code more modular and easier to maintain.

*Hint: autoreload module is a utility module in Python that allows you to automatically reload modules in the current session when changes are made to the source code. This can be useful in situations where you are actively developing code and want to see the effects of changes you make without having to constantly restart the Python interpreter or Jupyter Notebook kernel.*

In [ ]:
# Your code here

# Bonus: Challenge 3: Analyzing Clean and Formated Data

You have been tasked with analyzing the data to identify potential areas for improving customer retention and profitability. Your goal is to identify customers with a high policy claim amount and a low customer lifetime value.

In the Pandas Lab, we only looked at high policy claim amounts because we couldn't look into low customer lifetime values. If we had tried to work with that column, we wouldn't have been able to because customer lifetime value wasn't clean and in its proper format. So after cleaning and formatting the data, let's get some more interesting insights!

Instructions:

- Review the statistics again for total claim amount and customer lifetime value to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount and a low customer lifetime value. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount, and clients with a low customer lifetime value to be those in the bottom 25% of the customer lifetime value. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile and a customer lifetime value in the bottom 25th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount and low customer lifetime value data. To do so, select both columns of the dataframe simultaneously and pass it to the `.describe()` method. This will give you descriptive statistics, such as mean, median, standard deviation, minimum and maximum values for both columns at the same time, allowing you to compare and analyze their characteristics.

In [ ]:
# Your code here